using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
/*1 Разработать абстрактный класс Геометрическая Фигура с полями ПлощадьФигуры и ПериметрФигуры.
Разработать классы-наследники: Треугольник, Квадрат, Ромб, Прямоугольник, Параллелограмм, Трапеция,
Круг, Эллипс и реализовать свойства, которые однозначно определяют объекты данных классов.
Реализовать интерфейс ПростойНУгольник, который имеет свойства: Высота, Основание,
УголМеждуОснованиемИСмежнойСтороной, КоличествоСторон, Длины Сторон, Площадь, Периметр.
Реализовать класс СоставнаяФигура который может состоять из любого количества ПростыхНУгольников
Для данного класса определить метод нахождения площади фигуры.
Предусмотреть варианты невозможности задания фигуры (введены отрицательные длины сторон или при
создании объекта треугольника существует пара сторон, сумма длин которых меньше длины третьей стороны и т п ).*/
namespace C_sharp_DZ_6_1
{







    class Program
    {
        static void Main(string[] args)
        {




        }
    }
}
